src/Enums/ВариантыОтраженияРасхождений/ВариантыОтраженияРасхождений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыОтраженияРасхождений</name>
  <enumValues>
    <name>НедостачиЗаСчетСтороннейКомпании</name>
  </enumValues>
  <enumValues>
    <name>НедостачиЗаСчетПоставщика</name>
  </enumValues>
  <enumValues>
    <name>НедостачиНаПрочиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>ИзлишкиВПользуПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ИзлишкиНаПрочиеДоходы</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВариантыРасхождений/ВариантыРасхождений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыРасхождений</name>
  <enumValues>
    <name>Излишки</name>
  </enumValues>
  <enumValues>
    <name>Недостачи</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВариантыОтраженияРасхождений/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВариантРасхождений") Тогда
	
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений();
		
		Если Параметры.ВариантРасхождений = Перечисления.ВариантыРасхождений.Излишки Тогда
			
			ДанныеВыбора.Добавить(Перечисления.ВариантыОтраженияРасхождений.ИзлишкиВПользуПоставщика);
			ДанныеВыбора.Добавить(Перечисления.ВариантыОтраженияРасхождений.ИзлишкиНаПрочиеДоходы);
			
		ИначеЕсли Параметры.ВариантРасхождений = Перечисления.ВариантыРасхождений.Недостачи Тогда
			
			ДанныеВыбора.Добавить(Перечисления.ВариантыОтраженияРасхождений.НедостачиЗаСчетПоставщика);
			ДанныеВыбора.Добавить(Перечисления.ВариантыОтраженияРасхождений.НедостачиЗаСчетСтороннейКомпании);
			ДанныеВыбора.Добавить(Перечисления.ВариантыОтраженияРасхождений.НедостачиНаПрочиеРасходы);
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры
